tap "confluentinc/tap"
tap "derailed/k9s"
tap "fgeller/tap"
tap "hashicorp/tap"
tap "imhotepio/k9salpha"
tap "jandedobbeleer/oh-my-posh"
tap "joshmedeski/sesh"
tap "moncho/dry"
tap "nikitabobko/tap"
tap "one2nc/cloudlens"
tap "turbot/tap"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Command-line csv viewer
brew "csvlens"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Platform built on V8 to build network applications
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Apache Kafka C/C++ library
brew "librdkafka"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# Network authentication protocol
brew "krb5"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Powerful, lightweight programming language
brew "lua"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Ncurses-based file manager with vi-like keybindings
brew "vifm"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Kafka command line tools that likes JSON
brew "fgeller/tap/kt"
# Vault
brew "hashicorp/tap/vault"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "imhotepio/k9salpha/k9salpha"
# Smart terminal session manager
brew "joshmedeski/sesh/sesh"
brew "one2nc/cloudlens/cloudlens"
# Steampipe exposes APIs and services as a high-performance relational database, giving you the ability to write SQL-based queries to explore, assess and report on dynamic data.
brew "turbot/tap/steampipe"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Chromium based browser
cask "arc"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Reimagine your terminal
cask "fig"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Multiplayer code editor
cask "zed"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "vscodevim.vim"
vscode "withfig.fig"
